zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxe/pinctrl/MCXE32BMPB-pinctrl.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXE317MPA-pinctrl.h with this part's differences applied
 * below (7 removed, 7 changed,
 * 711 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: d34e27c0d05f080f
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXE32BMPB_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXE32BMPB_WRAPPER_

#include "MCXE317MPA-pinctrl.h"

/* Signals not present on this part */
#undef PTC17_FXIO_D2_I
#undef PTC17_FXIO_D2_O
#undef PTD6_FXIO_D3_I
#undef PTD6_FXIO_D3_O
#undef PTE12_CMP0_RR_ACTIVE
#undef PTE12_FXIO_D7_I
#undef PTE12_FXIO_D7_O

/* Signals with different mux data on this part */
#undef PTA24_EMIOS_1_CH7_H
#define PTA24_EMIOS_1_CH7_H             NXP_SIUL2_PINMUX(0, 0, 24, 0, 87, 2)
#undef PTA24_FXIO_D3
#define PTA24_FXIO_D3                   NXP_SIUL2_PINMUX(0, 0, 24, 0, 155, 3)
#undef PTA24_GPI24
#define PTA24_GPI24                     NXP_SIUL2_PINMUX(0, 0, 24, 0, 24, 0)
#undef PTA25_EIRQ5
#define PTA25_EIRQ5                     NXP_SIUL2_PINMUX(0, 0, 25, 0, 21, 2)
#undef PTA25_EMIOS_1_CH8_X
#define PTA25_EMIOS_1_CH8_X             NXP_SIUL2_PINMUX(0, 0, 25, 0, 88, 2)
#undef PTA25_FXIO_D2
#define PTA25_FXIO_D2                   NXP_SIUL2_PINMUX(0, 0, 25, 0, 154, 6)
#undef PTA25_GPI25
#define PTA25_GPI25                     NXP_SIUL2_PINMUX(0, 0, 25, 0, 25, 0)

/* Signals specific to this part */
#define PTA0_LPSPI4_PCS2_I              NXP_SIUL2_PINMUX(0, 0, 0, 0, 257, 1)
#define PTA0_LPSPI4_PCS2_O              NXP_SIUL2_PINMUX(0, 0, 0, 1, 0, 0)
#define PTA12_LPUART11_RX               NXP_SIUL2_PINMUX(0, 0, 12, 0, 198, 2)
#define PTA13_LPUART11_TX_I             NXP_SIUL2_PINMUX(0, 0, 13, 0, 374, 1)
#define PTA13_LPUART11_TX_O             NXP_SIUL2_PINMUX(0, 0, 13, 7, 0, 0)
#define PTA14_EMIOS_2_CH18_Y_I          NXP_SIUL2_PINMUX(0, 0, 14, 0, 130, 4)
#define PTA14_EMIOS_2_CH18_Y_O          NXP_SIUL2_PINMUX(0, 0, 14, 4, 0, 0)
#define PTA14_LPSPI5_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 14, 0, 263, 2)
#define PTA14_LPSPI5_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 14, 7, 0, 0)
#define PTA15_LPSPI5_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 15, 0, 262, 3)
#define PTA15_LPSPI5_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 15, 6, 0, 0)
#define PTA16_LPSPI4_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 16, 0, 258, 1)
#define PTA16_LPSPI4_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 16, 1, 0, 0)
#define PTA18_EMIOS_2_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 18, 0, 112, 2)
#define PTA18_EMIOS_2_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 18, 6, 0, 0)
#define PTA19_EMIOS_2_CH1_H_I           NXP_SIUL2_PINMUX(0, 0, 19, 0, 113, 2)
#define PTA19_EMIOS_2_CH1_H_O           NXP_SIUL2_PINMUX(0, 0, 19, 6, 0, 0)
#define PTA1_LPSPI4_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 1, 0, 256, 1)
#define PTA1_LPSPI4_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 1, 1, 0, 0)
#define PTA20_EMIOS_2_CH2_H_I           NXP_SIUL2_PINMUX(0, 0, 20, 0, 114, 2)
#define PTA20_EMIOS_2_CH2_H_O           NXP_SIUL2_PINMUX(0, 0, 20, 6, 0, 0)
#define PTA21_EMIOS_2_CH3_H_I           NXP_SIUL2_PINMUX(0, 0, 21, 0, 115, 2)
#define PTA21_EMIOS_2_CH3_H_O           NXP_SIUL2_PINMUX(0, 0, 21, 6, 0, 0)
#define PTA22_CAN1_RX                   NXP_SIUL2_PINMUX(0, 0, 22, 0, 1, 3)
#define PTA22_EMIOS_1_CH4_H_I           NXP_SIUL2_PINMUX(0, 0, 22, 0, 84, 1)
#define PTA22_EMIOS_1_CH4_H_O           NXP_SIUL2_PINMUX(0, 0, 22, 2, 0, 0)
#define PTA22_FXIO_D1_I                 NXP_SIUL2_PINMUX(0, 0, 22, 0, 153, 3)
#define PTA22_FXIO_D1_O                 NXP_SIUL2_PINMUX(0, 0, 22, 3, 0, 0)
#define PTA22_LPSPI1_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 22, 0, 233, 3)
#define PTA22_LPSPI1_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 22, 4, 0, 0)
#define PTA23_CAN1_TX                   NXP_SIUL2_PINMUX(0, 0, 23, 1, 0, 0)
#define PTA23_EMIOS_1_CH6_H_I           NXP_SIUL2_PINMUX(0, 0, 23, 0, 86, 2)
#define PTA23_EMIOS_1_CH6_H_O           NXP_SIUL2_PINMUX(0, 0, 23, 2, 0, 0)
#define PTA23_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 23, 0, 154, 3)
#define PTA23_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 23, 3, 0, 0)
#define PTA25_EMIOS_2_CH8_X             NXP_SIUL2_PINMUX(0, 0, 25, 0, 120, 2)
#define PTA26_EMAC_PPS0_I               NXP_SIUL2_PINMUX(0, 0, 26, 0, 144, 3)
#define PTA26_EMAC_PPS0_O               NXP_SIUL2_PINMUX(0, 0, 26, 7, 0, 0)
#define PTA26_EMIOS_1_CH9_H_I           NXP_SIUL2_PINMUX(0, 0, 26, 0, 89, 2)
#define PTA26_EMIOS_1_CH9_H_O           NXP_SIUL2_PINMUX(0, 0, 26, 2, 0, 0)
#define PTA26_EMIOS_2_CH9_H_I           NXP_SIUL2_PINMUX(0, 0, 26, 0, 121, 2)
#define PTA26_EMIOS_2_CH9_H_O           NXP_SIUL2_PINMUX(0, 0, 26, 6, 0, 0)
#define PTA26_FXIO_D1_I                 NXP_SIUL2_PINMUX(0, 0, 26, 0, 153, 7)
#define PTA26_FXIO_D1_O                 NXP_SIUL2_PINMUX(0, 0, 26, 5, 0, 0)
#define PTA26_LPSPI0_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 26, 0, 221, 3)
#define PTA26_LPSPI0_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 26, 4, 0, 0)
#define PTA26_LPSPI1_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 26, 0, 232, 5)
#define PTA26_LPSPI1_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 26, 3, 0, 0)
#define PTA27_EMAC_PPS1_I               NXP_SIUL2_PINMUX(0, 0, 27, 0, 145, 3)
#define PTA27_EMAC_PPS1_O               NXP_SIUL2_PINMUX(0, 0, 27, 3, 0, 0)
#define PTA27_EMIOS_2_CH10_H_I          NXP_SIUL2_PINMUX(0, 0, 27, 0, 122, 2)
#define PTA27_EMIOS_2_CH10_H_O          NXP_SIUL2_PINMUX(0, 0, 27, 6, 0, 0)
#define PTA28_EMIOS_2_CH11_H_I          NXP_SIUL2_PINMUX(0, 0, 28, 0, 123, 2)
#define PTA28_EMIOS_2_CH11_H_O          NXP_SIUL2_PINMUX(0, 0, 28, 6, 0, 0)
#define PTA29_EMAC_PPS2_I               NXP_SIUL2_PINMUX(0, 0, 29, 0, 146, 3)
#define PTA29_EMAC_PPS2_O               NXP_SIUL2_PINMUX(0, 0, 29, 3, 0, 0)
#define PTA29_EMIOS_2_CH12_H_I          NXP_SIUL2_PINMUX(0, 0, 29, 0, 124, 1)
#define PTA29_EMIOS_2_CH12_H_O          NXP_SIUL2_PINMUX(0, 0, 29, 6, 0, 0)
#define PTA2_LPSPI5_SIN_I               NXP_SIUL2_PINMUX(0, 0, 2, 0, 267, 2)
#define PTA2_LPSPI5_SIN_O               NXP_SIUL2_PINMUX(0, 0, 2, 7, 0, 0)
#define PTA30_EMIOS_2_CH13_H_I          NXP_SIUL2_PINMUX(0, 0, 30, 0, 125, 2)
#define PTA30_EMIOS_2_CH13_H_O          NXP_SIUL2_PINMUX(0, 0, 30, 6, 0, 0)
#define PTA3_LPSPI5_SCK_I               NXP_SIUL2_PINMUX(0, 0, 3, 0, 266, 2)
#define PTA3_LPSPI5_SCK_O               NXP_SIUL2_PINMUX(0, 0, 3, 7, 0, 0)
#define PTA8_EMIOS_2_CH7_H_I            NXP_SIUL2_PINMUX(0, 0, 8, 0, 119, 3)
#define PTA8_EMIOS_2_CH7_H_O            NXP_SIUL2_PINMUX(0, 0, 8, 6, 0, 0)
#define PTA9_CMP2_OUT                   NXP_SIUL2_PINMUX(0, 0, 9, 7, 0, 0)
#define PTB10_LPSPI4_SCK_I              NXP_SIUL2_PINMUX(0, 0, 42, 0, 259, 2)
#define PTB10_LPSPI4_SCK_O              NXP_SIUL2_PINMUX(0, 0, 42, 1, 0, 0)
#define PTB10_LPUART9_TX_I              NXP_SIUL2_PINMUX(0, 0, 42, 0, 372, 2)
#define PTB10_LPUART9_TX_O              NXP_SIUL2_PINMUX(0, 0, 42, 5, 0, 0)
#define PTB11_LPSPI4_SIN_I              NXP_SIUL2_PINMUX(0, 0, 43, 0, 260, 2)
#define PTB11_LPSPI4_SIN_O              NXP_SIUL2_PINMUX(0, 0, 43, 1, 0, 0)
#define PTB12_LPUART8_RX                NXP_SIUL2_PINMUX(0, 0, 44, 0, 195, 1)
#define PTB13_LPUART8_TX_I              NXP_SIUL2_PINMUX(0, 0, 45, 0, 371, 1)
#define PTB13_LPUART8_TX_O              NXP_SIUL2_PINMUX(0, 0, 45, 6, 0, 0)
#define PTB18_EMIOS_2_CH14_H_I          NXP_SIUL2_PINMUX(0, 0, 50, 0, 126, 2)
#define PTB18_EMIOS_2_CH14_H_O          NXP_SIUL2_PINMUX(0, 0, 50, 5, 0, 0)
#define PTB18_LPUART13_TX_I             NXP_SIUL2_PINMUX(0, 0, 50, 0, 376, 1)
#define PTB18_LPUART13_TX_O             NXP_SIUL2_PINMUX(0, 0, 50, 1, 0, 0)
#define PTB19_EMIOS_2_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 51, 0, 127, 3)
#define PTB19_EMIOS_2_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 51, 5, 0, 0)
#define PTB19_LPUART13_RX               NXP_SIUL2_PINMUX(0, 0, 51, 0, 200, 1)
#define PTB20_EMIOS_2_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 52, 0, 128, 2)
#define PTB20_EMIOS_2_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 52, 5, 0, 0)
#define PTB20_LPUART14_TX_I             NXP_SIUL2_PINMUX(0, 0, 52, 0, 377, 1)
#define PTB20_LPUART14_TX_O             NXP_SIUL2_PINMUX(0, 0, 52, 1, 0, 0)
#define PTB21_EMIOS_2_CH17_Y_I          NXP_SIUL2_PINMUX(0, 0, 53, 0, 129, 2)
#define PTB21_EMIOS_2_CH17_Y_O          NXP_SIUL2_PINMUX(0, 0, 53, 5, 0, 0)
#define PTB21_LPUART14_RX               NXP_SIUL2_PINMUX(0, 0, 53, 0, 201, 1)
#define PTB22_EMAC_MII_CRS              NXP_SIUL2_PINMUX(0, 0, 54, 0, 290, 1)
#define PTB22_EMIOS_2_CH18_Y_I          NXP_SIUL2_PINMUX(0, 0, 54, 0, 130, 2)
#define PTB22_EMIOS_2_CH18_Y_O          NXP_SIUL2_PINMUX(0, 0, 54, 4, 0, 0)
#define PTB23_EMAC_MII_COL              NXP_SIUL2_PINMUX(0, 0, 55, 0, 289, 1)
#define PTB23_EMIOS_2_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 55, 0, 131, 2)
#define PTB23_EMIOS_2_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 55, 4, 0, 0)
#define PTB24_EMIOS_2_CH20_Y_I          NXP_SIUL2_PINMUX(0, 0, 56, 0, 132, 2)
#define PTB24_EMIOS_2_CH20_Y_O          NXP_SIUL2_PINMUX(0, 0, 56, 4, 0, 0)
#define PTB25_EMIOS_2_CH21_Y_I          NXP_SIUL2_PINMUX(0, 0, 57, 0, 133, 2)
#define PTB25_EMIOS_2_CH21_Y_O          NXP_SIUL2_PINMUX(0, 0, 57, 4, 0, 0)
#define PTB25_LPUART15_TX_I             NXP_SIUL2_PINMUX(0, 0, 57, 0, 378, 1)
#define PTB25_LPUART15_TX_O             NXP_SIUL2_PINMUX(0, 0, 57, 1, 0, 0)
#define PTB26_EMIOS_2_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 58, 0, 134, 2)
#define PTB26_EMIOS_2_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 58, 4, 0, 0)
#define PTB26_LPUART15_RX               NXP_SIUL2_PINMUX(0, 0, 58, 0, 202, 1)
#define PTB27_EMIOS_2_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 59, 0, 135, 2)
#define PTB27_EMIOS_2_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 59, 4, 0, 0)
#define PTB28_EMAC_PPS3_I               NXP_SIUL2_PINMUX(0, 0, 60, 0, 147, 2)
#define PTB28_EMAC_PPS3_O               NXP_SIUL2_PINMUX(0, 0, 60, 7, 0, 0)
#define PTB28_EMIOS_2_CH10_H_I          NXP_SIUL2_PINMUX(0, 0, 60, 0, 122, 3)
#define PTB28_EMIOS_2_CH10_H_O          NXP_SIUL2_PINMUX(0, 0, 60, 4, 0, 0)
#define PTB29_EMIOS_2_CH11_H_I          NXP_SIUL2_PINMUX(0, 0, 61, 0, 123, 3)
#define PTB29_EMIOS_2_CH11_H_O          NXP_SIUL2_PINMUX(0, 0, 61, 4, 0, 0)
#define PTB29_SAI0_D1_I                 NXP_SIUL2_PINMUX(0, 0, 61, 0, 317, 1)
#define PTB29_SAI0_D1_O                 NXP_SIUL2_PINMUX(0, 0, 61, 7, 0, 0)
#define PTB2_LPUART9_RX                 NXP_SIUL2_PINMUX(0, 0, 34, 0, 196, 2)
#define PTB2_SAI0_D0_I                  NXP_SIUL2_PINMUX(0, 0, 34, 0, 316, 1)
#define PTB2_SAI0_D0_O                  NXP_SIUL2_PINMUX(0, 0, 34, 6, 0, 0)
#define PTB31_EIRQ15                    NXP_SIUL2_PINMUX(0, 0, 63, 0, 31, 2)
#define PTB31_HSE_TAMPER_EXTIN0         NXP_SIUL2_PINMUX(0, 0, 63, 0, 343, 3)
#define PTB3_LPUART9_TX_I               NXP_SIUL2_PINMUX(0, 0, 35, 0, 372, 1)
#define PTB3_LPUART9_TX_O               NXP_SIUL2_PINMUX(0, 0, 35, 1, 0, 0)
#define PTB3_SAI0_MCLK                  NXP_SIUL2_PINMUX(0, 0, 35, 0, 320, 1)
#define PTB4_EMAC_MII_RMII_MDIO_I       NXP_SIUL2_PINMUX(0, 0, 36, 0, 291, 1)
#define PTB4_EMAC_MII_RMII_MDIO_O       NXP_SIUL2_PINMUX(0, 0, 36, 5, 0, 0)
#define PTB4_EMAC_MII_RMII_TXD1         NXP_SIUL2_PINMUX(0, 0, 36, 1, 0, 0)
#define PTB5_EMAC_MII_RMII_MDC          NXP_SIUL2_PINMUX(0, 0, 37, 7, 0, 0)
#define PTB5_EMAC_MII_RMII_TXD0         NXP_SIUL2_PINMUX(0, 0, 37, 1, 0, 0)
#define PTB8_LPSPI4_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 40, 0, 255, 2)
#define PTB8_LPSPI4_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 40, 1, 0, 0)
#define PTB9_LPSPI4_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 41, 0, 261, 2)
#define PTB9_LPSPI4_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 41, 1, 0, 0)
#define PTB9_LPUART9_RX                 NXP_SIUL2_PINMUX(0, 0, 41, 0, 196, 1)
#define PTC0_EMAC_MII_RMII_RXD0         NXP_SIUL2_PINMUX(0, 0, 64, 0, 294, 2)
#define PTC0_EMAC_MII_RMII_RXD1         NXP_SIUL2_PINMUX(0, 0, 64, 0, 295, 1)
#define PTC0_EMAC_MII_RMII_TX_CLK       NXP_SIUL2_PINMUX(0, 0, 64, 0, 296, 4)
#define PTC10_LPSPI4_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 74, 0, 255, 1)
#define PTC10_LPSPI4_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 74, 5, 0, 0)
#define PTC10_LPUART11_TX_I             NXP_SIUL2_PINMUX(0, 0, 74, 0, 374, 2)
#define PTC10_LPUART11_TX_O             NXP_SIUL2_PINMUX(0, 0, 74, 2, 0, 0)
#define PTC11_LPSPI4_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 75, 0, 261, 1)
#define PTC11_LPSPI4_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 75, 5, 0, 0)
#define PTC11_LPUART11_RX               NXP_SIUL2_PINMUX(0, 0, 75, 0, 198, 1)
#define PTC12_LPUART10_RX               NXP_SIUL2_PINMUX(0, 0, 76, 0, 197, 2)
#define PTC12_SAI0_BCLK_I               NXP_SIUL2_PINMUX(0, 0, 76, 0, 315, 1)
#define PTC12_SAI0_BCLK_O               NXP_SIUL2_PINMUX(0, 0, 76, 7, 0, 0)
#define PTC13_LPUART10_TX_I             NXP_SIUL2_PINMUX(0, 0, 77, 0, 373, 1)
#define PTC13_LPUART10_TX_O             NXP_SIUL2_PINMUX(0, 0, 77, 1, 0, 0)
#define PTC13_SAI0_SYNC_I               NXP_SIUL2_PINMUX(0, 0, 77, 0, 321, 1)
#define PTC13_SAI0_SYNC_O               NXP_SIUL2_PINMUX(0, 0, 77, 7, 0, 0)
#define PTC14_EMAC_MII_COL              NXP_SIUL2_PINMUX(0, 0, 78, 0, 289, 2)
#define PTC14_EMAC_MII_RMII_RX_ER       NXP_SIUL2_PINMUX(0, 0, 78, 0, 293, 2)
#define PTC14_EMAC_MII_RXD3             NXP_SIUL2_PINMUX(0, 0, 78, 0, 302, 2)
#define PTC15_EMAC_MII_CRS              NXP_SIUL2_PINMUX(0, 0, 79, 0, 290, 2)
#define PTC15_EMAC_MII_RMII_RX_DV       NXP_SIUL2_PINMUX(0, 0, 79, 0, 292, 2)
#define PTC15_EMAC_MII_RXD2             NXP_SIUL2_PINMUX(0, 0, 79, 0, 301, 2)
#define PTC16_EMAC_MII_RMII_RX_ER       NXP_SIUL2_PINMUX(0, 0, 80, 0, 293, 1)
#define PTC16_EMIOS_2_CH9_H_I           NXP_SIUL2_PINMUX(0, 0, 80, 0, 121, 4)
#define PTC16_EMIOS_2_CH9_H_O           NXP_SIUL2_PINMUX(0, 0, 80, 3, 0, 0)
#define PTC17_EMAC_MII_RMII_RX_DV       NXP_SIUL2_PINMUX(0, 0, 81, 0, 292, 1)
#define PTC18_EMIOS_2_CH12_H_I          NXP_SIUL2_PINMUX(0, 0, 82, 0, 124, 3)
#define PTC18_EMIOS_2_CH12_H_O          NXP_SIUL2_PINMUX(0, 0, 82, 4, 0, 0)
#define PTC18_SAI0_D2_I                 NXP_SIUL2_PINMUX(0, 0, 82, 0, 318, 1)
#define PTC18_SAI0_D2_O                 NXP_SIUL2_PINMUX(0, 0, 82, 7, 0, 0)
#define PTC19_EMIOS_2_CH13_H_I          NXP_SIUL2_PINMUX(0, 0, 83, 0, 125, 3)
#define PTC19_EMIOS_2_CH13_H_O          NXP_SIUL2_PINMUX(0, 0, 83, 4, 0, 0)
#define PTC19_SAI0_D3_I                 NXP_SIUL2_PINMUX(0, 0, 83, 0, 319, 1)
#define PTC19_SAI0_D3_O                 NXP_SIUL2_PINMUX(0, 0, 83, 7, 0, 0)
#define PTC1_EMAC_MII_RMII_RXD0         NXP_SIUL2_PINMUX(0, 0, 65, 0, 294, 1)
#define PTC1_EMAC_MII_RMII_RXD1         NXP_SIUL2_PINMUX(0, 0, 65, 0, 295, 2)
#define PTC1_EMAC_MII_RX_CLK            NXP_SIUL2_PINMUX(0, 0, 65, 0, 300, 3)
#define PTC20_EMIOS_2_CH14_H_I          NXP_SIUL2_PINMUX(0, 0, 84, 0, 126, 3)
#define PTC20_EMIOS_2_CH14_H_O          NXP_SIUL2_PINMUX(0, 0, 84, 4, 0, 0)
#define PTC21_EMIOS_2_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 85, 0, 127, 5)
#define PTC21_EMIOS_2_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 85, 4, 0, 0)
#define PTC22_EMIOS_0_CH8_X_I           NXP_SIUL2_PINMUX(0, 0, 86, 0, 56, 3)
#define PTC22_EMIOS_0_CH8_X_O           NXP_SIUL2_PINMUX(0, 0, 86, 1, 0, 0)
#define PTC24_EMIOS_2_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 88, 0, 112, 5)
#define PTC24_EMIOS_2_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 88, 4, 0, 0)
#define PTC24_LPUART12_TX_I             NXP_SIUL2_PINMUX(0, 0, 88, 0, 375, 1)
#define PTC24_LPUART12_TX_O             NXP_SIUL2_PINMUX(0, 0, 88, 1, 0, 0)
#define PTC25_EMIOS_2_CH1_H_I           NXP_SIUL2_PINMUX(0, 0, 89, 0, 113, 3)
#define PTC25_EMIOS_2_CH1_H_O           NXP_SIUL2_PINMUX(0, 0, 89, 4, 0, 0)
#define PTC25_LPSPI4_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 89, 0, 256, 4)
#define PTC25_LPSPI4_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 89, 5, 0, 0)
#define PTC25_LPUART12_RX               NXP_SIUL2_PINMUX(0, 0, 89, 0, 199, 2)
#define PTC26_EMIOS_2_CH2_H_I           NXP_SIUL2_PINMUX(0, 0, 90, 0, 114, 3)
#define PTC26_EMIOS_2_CH2_H_O           NXP_SIUL2_PINMUX(0, 0, 90, 4, 0, 0)
#define PTC26_LPSPI4_SIN_I              NXP_SIUL2_PINMUX(0, 0, 90, 0, 260, 1)
#define PTC26_LPSPI4_SIN_O              NXP_SIUL2_PINMUX(0, 0, 90, 7, 0, 0)
#define PTC26_LPUART13_TX_I             NXP_SIUL2_PINMUX(0, 0, 90, 0, 376, 2)
#define PTC26_LPUART13_TX_O             NXP_SIUL2_PINMUX(0, 0, 90, 1, 0, 0)
#define PTC27_EMIOS_2_CH3_H_I           NXP_SIUL2_PINMUX(0, 0, 91, 0, 115, 3)
#define PTC27_EMIOS_2_CH3_H_O           NXP_SIUL2_PINMUX(0, 0, 91, 4, 0, 0)
#define PTC27_LPSPI4_SCK_I              NXP_SIUL2_PINMUX(0, 0, 91, 0, 259, 1)
#define PTC27_LPSPI4_SCK_O              NXP_SIUL2_PINMUX(0, 0, 91, 7, 0, 0)
#define PTC27_LPUART13_RX               NXP_SIUL2_PINMUX(0, 0, 91, 0, 200, 2)
#define PTC29_EMIOS_2_CH4_H_I           NXP_SIUL2_PINMUX(0, 0, 93, 0, 116, 2)
#define PTC29_EMIOS_2_CH4_H_O           NXP_SIUL2_PINMUX(0, 0, 93, 4, 0, 0)
#define PTC2_EMAC_MII_RMII_TXD0         NXP_SIUL2_PINMUX(0, 0, 66, 5, 0, 0)
#define PTC2_EMAC_MII_RMII_TXD1         NXP_SIUL2_PINMUX(0, 0, 66, 1, 0, 0)
#define PTC2_QUADSPI_IOFA3_I            NXP_SIUL2_PINMUX(0, 0, 66, 0, 308, 1)
#define PTC2_QUADSPI_IOFA3_O            NXP_SIUL2_PINMUX(0, 0, 66, 7, 0, 0)
#define PTC2_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 66, 6, 0, 0)
#define PTC30_EMIOS_2_CH5_H_I           NXP_SIUL2_PINMUX(0, 0, 94, 0, 117, 3)
#define PTC30_EMIOS_2_CH5_H_O           NXP_SIUL2_PINMUX(0, 0, 94, 4, 0, 0)
#define PTC31_EMIOS_2_CH6_H_I           NXP_SIUL2_PINMUX(0, 0, 95, 0, 118, 2)
#define PTC31_EMIOS_2_CH6_H_O           NXP_SIUL2_PINMUX(0, 0, 95, 5, 0, 0)
#define PTC3_QUADSPI_PCSFA              NXP_SIUL2_PINMUX(0, 0, 67, 6, 0, 0)
#define PTC5_CMP2_RR_ACTIVE             NXP_SIUL2_PINMUX(0, 0, 69, 5, 0, 0)
#define PTD10_EMAC_MII_RX_CLK           NXP_SIUL2_PINMUX(0, 0, 106, 0, 300, 1)
#define PTD10_EMAC_MII_TXD3             NXP_SIUL2_PINMUX(0, 0, 106, 1, 0, 0)
#define PTD10_QUADSPI_SCKFA_I           NXP_SIUL2_PINMUX(0, 0, 106, 0, 309, 1)
#define PTD10_QUADSPI_SCKFA_O           NXP_SIUL2_PINMUX(0, 0, 106, 7, 0, 0)
#define PTD10_TRACE_ETM_D3              NXP_SIUL2_PINMUX(0, 0, 106, 4, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_CLK      NXP_SIUL2_PINMUX(0, 0, 107, 0, 296, 1)
#define PTD11_EMAC_MII_RMII_TX_EN       NXP_SIUL2_PINMUX(0, 0, 107, 3, 0, 0)
#define PTD11_EMAC_MII_TXD2             NXP_SIUL2_PINMUX(0, 0, 107, 1, 0, 0)
#define PTD11_QUADSPI_IOFA0_I           NXP_SIUL2_PINMUX(0, 0, 107, 0, 305, 1)
#define PTD11_QUADSPI_IOFA0_O           NXP_SIUL2_PINMUX(0, 0, 107, 7, 0, 0)
#define PTD11_TRACE_ETM_D2              NXP_SIUL2_PINMUX(0, 0, 107, 4, 0, 0)
#define PTD12_EMAC_MII_RMII_TX_CLK      NXP_SIUL2_PINMUX(0, 0, 108, 0, 296, 3)
#define PTD12_EMAC_MII_RMII_TX_EN       NXP_SIUL2_PINMUX(0, 0, 108, 5, 0, 0)
#define PTD12_QUADSPI_IOFA2_I           NXP_SIUL2_PINMUX(0, 0, 108, 0, 307, 1)
#define PTD12_QUADSPI_IOFA2_O           NXP_SIUL2_PINMUX(0, 0, 108, 7, 0, 0)
#define PTD12_TRACE_ETM_D1              NXP_SIUL2_PINMUX(0, 0, 108, 4, 0, 0)
#define PTD13_EMAC_PPS1_I               NXP_SIUL2_PINMUX(0, 0, 109, 0, 145, 2)
#define PTD13_EMAC_PPS1_O               NXP_SIUL2_PINMUX(0, 0, 109, 5, 0, 0)
#define PTD13_LPSPI5_SIN_I              NXP_SIUL2_PINMUX(0, 0, 109, 0, 267, 1)
#define PTD13_LPSPI5_SIN_O              NXP_SIUL2_PINMUX(0, 0, 109, 1, 0, 0)
#define PTD13_SAI1_D0_I                 NXP_SIUL2_PINMUX(0, 0, 109, 0, 323, 1)
#define PTD13_SAI1_D0_O                 NXP_SIUL2_PINMUX(0, 0, 109, 6, 0, 0)
#define PTD14_EMAC_PPS0_I               NXP_SIUL2_PINMUX(0, 0, 110, 0, 144, 2)
#define PTD14_EMAC_PPS0_O               NXP_SIUL2_PINMUX(0, 0, 110, 5, 0, 0)
#define PTD14_LPSPI5_SCK_I              NXP_SIUL2_PINMUX(0, 0, 110, 0, 266, 1)
#define PTD14_LPSPI5_SCK_O              NXP_SIUL2_PINMUX(0, 0, 110, 1, 0, 0)
#define PTD14_SAI1_MCLK                 NXP_SIUL2_PINMUX(0, 0, 110, 0, 324, 1)
#define PTD15_EMAC_PPS2_I               NXP_SIUL2_PINMUX(0, 0, 111, 0, 146, 2)
#define PTD15_EMAC_PPS2_O               NXP_SIUL2_PINMUX(0, 0, 111, 5, 0, 0)
#define PTD15_LPUART8_RX                NXP_SIUL2_PINMUX(0, 0, 111, 0, 195, 2)
#define PTD15_SAI1_SYNC_I               NXP_SIUL2_PINMUX(0, 0, 111, 0, 325, 1)
#define PTD15_SAI1_SYNC_O               NXP_SIUL2_PINMUX(0, 0, 111, 6, 0, 0)
#define PTD16_EMAC_MII_RMII_MDIO_I      NXP_SIUL2_PINMUX(0, 0, 112, 0, 291, 2)
#define PTD16_EMAC_MII_RMII_MDIO_O      NXP_SIUL2_PINMUX(0, 0, 112, 3, 0, 0)
#define PTD16_LPUART8_TX_I              NXP_SIUL2_PINMUX(0, 0, 112, 0, 371, 2)
#define PTD16_LPUART8_TX_O              NXP_SIUL2_PINMUX(0, 0, 112, 7, 0, 0)
#define PTD17_EMAC_MII_RMII_MDC         NXP_SIUL2_PINMUX(0, 0, 113, 3, 0, 0)
#define PTD17_EMAC_PPS2_I               NXP_SIUL2_PINMUX(0, 0, 113, 0, 146, 1)
#define PTD17_EMAC_PPS2_O               NXP_SIUL2_PINMUX(0, 0, 113, 7, 0, 0)
#define PTD17_LPSPI5_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 113, 0, 262, 1)
#define PTD17_LPSPI5_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 113, 1, 0, 0)
#define PTD19_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 115, 0, 2, 4)
#define PTD19_EMIOS_1_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 115, 0, 96, 2)
#define PTD19_EMIOS_1_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 115, 2, 0, 0)
#define PTD19_FXIO_D3_I                 NXP_SIUL2_PINMUX(0, 0, 115, 0, 155, 4)
#define PTD19_FXIO_D3_O                 NXP_SIUL2_PINMUX(0, 0, 115, 3, 0, 0)
#define PTD20_EMIOS_2_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 116, 0, 112, 3)
#define PTD20_EMIOS_2_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 116, 4, 0, 0)
#define PTD21_EMIOS_2_CH8_X_I           NXP_SIUL2_PINMUX(0, 0, 117, 0, 120, 3)
#define PTD21_EMIOS_2_CH8_X_O           NXP_SIUL2_PINMUX(0, 0, 117, 4, 0, 0)
#define PTD22_EMIOS_2_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 118, 0, 134, 3)
#define PTD22_EMIOS_2_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 118, 4, 0, 0)
#define PTD23_EMIOS_2_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 119, 0, 135, 3)
#define PTD23_EMIOS_2_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 119, 4, 0, 0)
#define PTD25_EMIOS_1_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 121, 0, 102, 1)
#define PTD25_EMIOS_1_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 121, 2, 0, 0)
#define PTD26_EMIOS_2_CH7_H_I           NXP_SIUL2_PINMUX(0, 0, 122, 0, 119, 1)
#define PTD26_EMIOS_2_CH7_H_O           NXP_SIUL2_PINMUX(0, 0, 122, 4, 0, 0)
#define PTD26_LPSPI5_SCK_I              NXP_SIUL2_PINMUX(0, 0, 122, 0, 266, 3)
#define PTD26_LPSPI5_SCK_O              NXP_SIUL2_PINMUX(0, 0, 122, 6, 0, 0)
#define PTD26_LPUART14_TX_I             NXP_SIUL2_PINMUX(0, 0, 122, 0, 377, 2)
#define PTD26_LPUART14_TX_O             NXP_SIUL2_PINMUX(0, 0, 122, 1, 0, 0)
#define PTD27_EMIOS_2_CH9_H_I           NXP_SIUL2_PINMUX(0, 0, 123, 0, 121, 3)
#define PTD27_EMIOS_2_CH9_H_O           NXP_SIUL2_PINMUX(0, 0, 123, 4, 0, 0)
#define PTD27_LPSPI5_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 123, 0, 268, 3)
#define PTD27_LPSPI5_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 123, 6, 0, 0)
#define PTD27_LPUART14_RX               NXP_SIUL2_PINMUX(0, 0, 123, 0, 201, 2)
#define PTD28_EMIOS_2_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 124, 0, 112, 4)
#define PTD28_EMIOS_2_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 124, 4, 0, 0)
#define PTD28_LPSPI5_SIN_I              NXP_SIUL2_PINMUX(0, 0, 124, 0, 267, 3)
#define PTD28_LPSPI5_SIN_O              NXP_SIUL2_PINMUX(0, 0, 124, 6, 0, 0)
#define PTD28_LPUART15_TX_I             NXP_SIUL2_PINMUX(0, 0, 124, 0, 378, 2)
#define PTD28_LPUART15_TX_O             NXP_SIUL2_PINMUX(0, 0, 124, 1, 0, 0)
#define PTD29_EMIOS_2_CH8_X_I           NXP_SIUL2_PINMUX(0, 0, 125, 0, 120, 4)
#define PTD29_EMIOS_2_CH8_X_O           NXP_SIUL2_PINMUX(0, 0, 125, 4, 0, 0)
#define PTD29_LPSPI5_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 125, 0, 264, 1)
#define PTD29_LPSPI5_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 125, 6, 0, 0)
#define PTD29_LPUART15_RX               NXP_SIUL2_PINMUX(0, 0, 125, 0, 202, 2)
#define PTD2_LPSPI5_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 98, 0, 268, 2)
#define PTD2_LPSPI5_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 98, 7, 0, 0)
#define PTD30_EMIOS_2_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 126, 0, 128, 3)
